{
  "what is panchakarma": "Panchakarma is a detoxification and rejuvenation therapy in Ayurveda that removes toxins from the body and restores balance.",
  "benefits of panchakarma": "Panchakarma improves digestion, strengthens immunity, balances doshas, increases energy, and supports mental clarity.",
  "types of panchakarma": "The five main Panchakarma therapies are Vamana (emesis), Virechana (purgation), Basti (enema), Nasya (nasal therapy), and Raktamokshana (bloodletting).",
  "before panchakarma": "Follow a light vegetarian diet, avoid oily and junk food, practice gentle yoga, and sleep early before Panchakarma.",
  "after panchakarma": "After Panchakarma, rest well, eat light and easily digestible food, avoid heavy exercise, and follow your doctor's instructions.",
  "diet after panchakarma": "Consume warm, soft, and light foods like khichdi, soups, herbal teas, and avoid fried or spicy food.",
  "who should do panchakarma": "Panchakarma is beneficial for people with digestive issues, stress, obesity, skin disorders, and those seeking detoxification.",
  "contraindications of panchakarma": "Panchakarma is not advised during pregnancy, very old age, very young children, or severe weakness.",
  "panchakarma duration": "A full Panchakarma program typically lasts between 7 to 21 days depending on the condition.",
  "panchakarma cost": "The cost of Panchakarma varies widely depending on the center, ranging from ₹10,000 to ₹50,000 for a full course.",
  
  "surya namaskar": "Surya Namaskar is a sequence of 12 yoga postures performed in the morning to energize the body and mind.",
  "benefits of surya namaskar": "Surya Namaskar improves flexibility, boosts circulation, aids weight loss, strengthens muscles, and calms the mind.",
  "when to do surya namaskar": "Perform Surya Namaskar early morning on an empty stomach, ideally facing the sun.",
  "how many rounds of surya namaskar": "Traditionally 12 rounds are recommended daily, but beginners can start with 3–6 rounds.",
  "surya namaskar for beginners": "Start slowly with 3–4 rounds, focus on breathing, and increase gradually.",
  
  "dinacharya": "Dinacharya is the Ayurvedic daily routine which includes waking up early, cleansing, yoga, meditation, and balanced meals.",
  "benefits of dinacharya": "Dinacharya helps maintain balance, prevents diseases, improves mental clarity, and enhances longevity.",
  "oil pulling": "Oil pulling is swishing oil (like sesame or coconut) in the mouth for 10–15 minutes to remove toxins and improve oral health.",
  "tongue scraping": "Tongue scraping removes toxins, improves digestion, and reduces bad breath.",
  
  "ritucharya": "Ritucharya is the seasonal routine in Ayurveda to balance the body according to weather changes.",
  "summer routine": "In summer, eat cooling foods like cucumber, melons, drink buttermilk, and avoid hot, spicy food.",
  "winter routine": "In winter, eat warm, nourishing foods, ghee, soups, and practice regular exercise.",
  "rainy season routine": "During monsoon, avoid raw foods, eat warm light meals, and protect against infections.",
  
  "vata dosha": "Vata is the air and space element. Its qualities are dry, light, cold, and irregular.",
  "pitta dosha": "Pitta is the fire element. Its qualities are hot, sharp, and intense.",
  "kapha dosha": "Kapha is the water and earth element. Its qualities are heavy, stable, and cool.",
  "vata imbalance": "Vata imbalance causes anxiety, dry skin, constipation, and insomnia.",
  "pitta imbalance": "Pitta imbalance leads to anger, acidity, skin rashes, and ulcers.",
  "kapha imbalance": "Kapha imbalance causes lethargy, obesity, congestion, and depression.",
  "balance vata": "Eat warm, oily foods, maintain routine, stay warm, and do calming yoga.",
  "balance pitta": "Eat cooling foods, avoid spicy food, stay calm, and practice meditation.",
  "balance kapha": "Eat light, spicy foods, exercise daily, avoid sweets, and stay active.",
  
  "abhyanga massage": "Abhyanga is a full-body oil massage with warm herbal oils to nourish tissues and calm the mind.",
  "benefits of abhyanga": "It improves circulation, nourishes skin, calms the nervous system, and removes toxins.",
  "nasya therapy": "Nasya is the administration of herbal oils or powders through the nose to clear sinuses and balance doshas.",
  "benefits of nasya": "Nasya relieves sinus issues, improves breathing, sharpens memory, and reduces stress.",
  "shirodhara": "Shirodhara is pouring warm oil on the forehead continuously to calm the nervous system and reduce stress.",
  "benefits of shirodhara": "Shirodhara improves sleep, reduces anxiety, enhances focus, and balances hormones.",
  "basti therapy": "Basti is a medicated enema therapy that cleanses the colon and balances Vata.",
  "virechana therapy": "Virechana is purgation therapy using herbal laxatives to cleanse the intestines and balance Pitta.",
  "vamana therapy": "Vamana is therapeutic vomiting to clear excess Kapha from the body.",
  "raktamokshana": "Raktamokshana is blood purification therapy used for skin and blood-related disorders.",
  
  "ayurvedic diet": "Ayurvedic diet emphasizes fresh, seasonal, and dosha-balancing foods.",
  "best foods for vata": "Cooked grains, warm soups, ghee, milk, and root vegetables are best for Vata.",
  "best foods for pitta": "Cooling foods like cucumber, melons, rice, milk, and leafy greens suit Pitta.",
  "best foods for kapha": "Light, dry, spicy foods like beans, apples, and barley balance Kapha.",
  "avoid for vata": "Avoid raw, cold, dry, and processed foods if you have Vata imbalance.",
  "avoid for pitta": "Avoid spicy, oily, fried foods, alcohol, and sour fruits for Pitta imbalance.",
  "avoid for kapha": "Avoid heavy, oily, sweet, and dairy-rich foods for Kapha imbalance.",
  
  "ayurvedic herbs": "Common Ayurvedic herbs include Ashwagandha, Triphala, Turmeric, Brahmi, and Tulsi.",
  "ashwagandha": "Ashwagandha reduces stress, improves strength, boosts immunity, and supports sleep.",
  "triphala": "Triphala supports digestion, cleanses toxins, and improves bowel movement.",
  "turmeric": "Turmeric reduces inflammation, supports immunity, and purifies blood.",
  "brahmi": "Brahmi enhances memory, reduces stress, and improves concentration.",
  "tulsi": "Tulsi strengthens immunity, clears respiratory issues, and reduces stress.",
  "giloy": "Giloy boosts immunity, reduces fever, and fights infections.",
  "neem": "Neem purifies blood, improves skin health, and supports detoxification.",
  
  "yoga for stress": "Practices like Anulom Vilom, Shavasana, and gentle yoga relieve stress.",
  "yoga for digestion": "Pawanmuktasana, Vajrasana, and Surya Namaskar improve digestion.",
  "yoga for weight loss": "Surya Namaskar, Kapalabhati, and Vinyasa yoga help weight management.",
  "yoga for sleep": "Shavasana, Yoga Nidra, and Bhramari Pranayama help with insomnia.",
  
  "pranayama": "Pranayama is controlled breathing that balances energy and calms the mind.",
  "anulom vilom": "Anulom Vilom is alternate nostril breathing for balance and calmness.",
  "kapalabhati": "Kapalabhati is a rapid breathing exercise to detox lungs and improve digestion.",
  "bhramari pranayama": "Bhramari involves humming like a bee to reduce stress and calm the mind.",
  "ujjayi pranayama": "Ujjayi or ocean breath is used in yoga to enhance focus and calm the mind.",
  
  "ayurvedic skincare": "Ayurvedic skincare uses natural herbs like turmeric, neem, sandalwood, and aloe vera.",
  "acne treatment": "Neem paste, turmeric, and sandalwood help reduce acne naturally.",
  "hair care in ayurveda": "Bhringraj oil, amla, and hibiscus promote healthy hair and prevent dandruff.",
  "dandruff remedy": "Neem oil, lemon, and aloe vera help reduce dandruff.",
  
  "ayurvedic lifestyle": "Ayurveda promotes balanced diet, daily yoga, meditation, and seasonal routines.",
  "ayurveda for immunity": "Herbs like Tulsi, Giloy, Ashwagandha, and Chyawanprash boost immunity.",
  "ayurveda for diabetes": "Bitter gourd, fenugreek, and Triphala are helpful in managing diabetes.",
  "ayurveda for hypertension": "Garlic, Ashwagandha, yoga, and meditation help control blood pressure.",
  "ayurveda for arthritis": "Guggul, ginger, turmeric, and Panchakarma therapies help relieve arthritis.",
  "ayurveda for asthma": "Sitopaladi churna, Tulsi, honey, and pranayama help manage asthma.",
  "ayurveda for constipation": "Triphala, ghee, and warm water help relieve constipation naturally.",
  "ayurveda for weight loss": "Drink warm water, use Triphala, practice yoga, and eat light meals.",
  
  "ayurveda for stress": "Ashwagandha, Brahmi, meditation, and Shirodhara are excellent for stress management.",
  "ayurveda for anxiety": "Brahmi, meditation, pranayama, and Nasya therapy help reduce anxiety.",
  "ayurveda for depression": "St. John’s wort, Brahmi, meditation, and regular exercise help balance mood.",
  
  "sleep tips": "Go to bed before 10 pm, avoid screens, drink warm milk, and practice meditation.",
  "early morning routine": "Wake up before sunrise, scrape tongue, oil pulling, yoga, and meditation.",
  "ayurvedic detox": "Ayurvedic detox includes Panchakarma, Triphala, herbal teas, and yoga."
}